result_not_consolidated/4core_4iothread/sysbench_5threads/sm110(icelake)_not_consolidated_4core_4iothread/multiplier_100/run1.txt
# run=1/5
# 2026-04-09T00:32:07-05:00

# cmd: taskset -c 5-31 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=5
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 5
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1816948
        write:                           517089
        other:                           258813
        total:                           2592850
    transactions:                        129031 (2150.43 per sec.)
    queries:                             2592850 (43212.33 per sec.)
    ignored errors:                      751    (12.52 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2150.4253
    time elapsed:                        60.0025s
    total number of events:              129031

Latency (ms):
         min:                                    1.18
         avg:                                    2.32
         max:                                   24.28
         95th percentile:                        3.02
         sum:                               299825.22

Threads fairness:
    events (avg/stddev):           25806.2000/291.79
    execution time (avg/stddev):   59.9650/0.00